In [13]:
import pandas as pd 
import numpy as np
import os 
from sqlalchemy import create_engine

In [14]:
#creates a table for each csv file in a list 
# assigns a table name based on the name of the file 
# turns it into a dataframe 
#pushes the dataframe to

In [21]:
'''for file in csv_files:
    df = pd.read_csv(file)
    df.to_sql('tweet', engine, index=False # Not copying over the index)'''

"for file in csv_files:\n    df = pd.read_csv(file)\n    df.to_sql('tweet', engine, index=False # Not copying over the index)"

In [25]:
#ecncoding was in latin, rather than utf8
df = pd.read_csv("ipi_account_lookup.csv", encoding ='latin1')

In [18]:
df.head(10)

   Account_No  Month_ID Product_Category  Marketing Spend
0    99696211       132         Services         2,129,525
1    99696211       136         Services         1,960,884
2    22525115       128         Services         1,720,383
3    99696211       131         Services         1,680,485
4    72828522       135         Services         1,476,959
5    99696211       129         Services         1,359,416
6    99696211       126         Services         1,337,950
7    99696211       138         Services         1,236,157
8    99696211       133         Services         1,036,849
9    22525115       131         Services         1,025,520

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19232 entries, 0 to 19231
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account_No         19232 non-null  int64
 1   Month_ID           19232 non-null  int64
 2   Product_Category   19232 non-null  object
 3    Marketing Spend   19232 non-null  object
dtypes: int64(2), object(2)
memory usage: 601.1+ KB

In [7]:
engine = create_engine('postgresql://postgres:noyS9oud!@localhost:5432/dbo.examples.marketing_practice')

In [8]:
df.to_sql('tweet', engine, index=False # Not copying over the index)